In [1]:
import pandas as pd
import numpy as np

In [2]:
data = np.random.randn(4,3)

In [3]:
data

array([[-0.27927066, -0.11749099, -0.40665046],
       [ 1.32560839, -0.18718984,  1.22922085],
       [ 0.39903739,  0.74372328,  0.39401003],
       [-0.90829571, -1.50335826,  0.26119027]])

In [4]:
dataFrame = pd.DataFrame(data)

In [5]:
dataFrame #dataFrame -> verileri tablo şeklinde gösterir

          0         1         2
0 -0.279271 -0.117491 -0.406650
1  1.325608 -0.187190  1.229221
2  0.399037  0.743723  0.394010
3 -0.908296 -1.503358  0.261190

In [6]:
dataFrame[0] # ilk kolonu getirir

0   -0.279271
1    1.325608
2    0.399037
3   -0.908296
Name: 0, dtype: float64

In [38]:
yeniDataFrame = pd.DataFrame(data, index=["Behçet","Yavuz","Gizem","Şevval"], columns=["Maaş","Yaş","Çalışma Saati"])

In [39]:
yeniDataFrame #satır ve kolonların isimleri değiştirebiliriz

            Maaş       Yaş  Çalışma Saati
Behçet -0.279271 -0.117491      -0.406650
Yavuz   1.325608 -0.187190       1.229221
Gizem   0.399037  0.743723       0.394010
Şevval -0.908296 -1.503358       0.261190

In [9]:
yeniDataFrame["Maaş"]

Behçet   -0.279271
Yavuz     1.325608
Gizem     0.399037
Şevval   -0.908296
Name: Maaş, dtype: float64

In [10]:
yeniDataFrame[["Yaş","Çalışma Saati"]] # sadece seçili olan kolandaki verileri getirir

             Yaş  Çalışma Saati
Behçet -0.117491      -0.406650
Yavuz  -0.187190       1.229221
Gizem   0.743723       0.394010
Şevval -1.503358       0.261190

In [11]:
yeniDataFrame.loc["Behçet"] #loc -> satırlardaki index'leri baz alır. default olarak kolonlardaki index'leri baz alır

Maaş            -0.279271
Yaş             -0.117491
Çalışma Saati   -0.406650
Name: Behçet, dtype: float64

In [12]:
yeniDataFrame.iloc[1] # iloc -> satırları baz alır ama index isimlerini değil index numaralarını baz alır

Maaş             1.325608
Yaş             -0.187190
Çalışma Saati    1.229221
Name: Yavuz, dtype: float64

In [13]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati
Behçet -0.279271 -0.117491      -0.406650
Yavuz   1.325608 -0.187190       1.229221
Gizem   0.399037  0.743723       0.394010
Şevval -0.908296 -1.503358       0.261190

In [14]:
yeniDataFrame["Emeklilik Yaşı"] = yeniDataFrame["Maaş"] * 2 # dataFrame'e kolayca yeni kolon ekleyebiliriz

In [15]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati  Emeklilik Yaşı
Behçet -0.279271 -0.117491      -0.406650       -0.558541
Yavuz   1.325608 -0.187190       1.229221        2.651217
Gizem   0.399037  0.743723       0.394010        0.798075
Şevval -0.908296 -1.503358       0.261190       -1.816591

In [16]:
yeniDataFrame.drop("Emeklilik Yaşı", axis=1) #kolon siler, satır(row) silmek için axis=0(default) olması gerekir

            Maaş       Yaş  Çalışma Saati
Behçet -0.279271 -0.117491      -0.406650
Yavuz   1.325608 -0.187190       1.229221
Gizem   0.399037  0.743723       0.394010
Şevval -0.908296 -1.503358       0.261190

In [17]:
yeniDataFrame #drop direkt dataFrame üzerinde değişiklik yapmaz

            Maaş       Yaş  Çalışma Saati  Emeklilik Yaşı
Behçet -0.279271 -0.117491      -0.406650       -0.558541
Yavuz   1.325608 -0.187190       1.229221        2.651217
Gizem   0.399037  0.743723       0.394010        0.798075
Şevval -0.908296 -1.503358       0.261190       -1.816591

In [18]:
yeniDataFrame.drop("Emeklilik Yaşı", axis=1, inplace=True)  #inplace -> dataFrame de değişiklik yap anlamına  gelir

In [19]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati
Behçet -0.279271 -0.117491      -0.406650
Yavuz   1.325608 -0.187190       1.229221
Gizem   0.399037  0.743723       0.394010
Şevval -0.908296 -1.503358       0.261190

In [20]:
yeniDataFrame[yeniDataFrame < 0] #sıfırdan küçük değerleri gösterir

            Maaş       Yaş  Çalışma Saati
Behçet -0.279271 -0.117491       -0.40665
Yavuz        NaN -0.187190            NaN
Gizem        NaN       NaN            NaN
Şevval -0.908296 -1.503358            NaN

In [21]:
yeniDataFrame[yeniDataFrame["Yaş"] > 0] # Yaş değeri 0 dan büyük olan satırları gösterir

           Maaş       Yaş  Çalışma Saati
Gizem  0.399037  0.743723        0.39401

## Index Ayarlama

In [22]:
yeniDataFrame.reset_index() # row'lardaki index'leri index adında yeni kolona aktarır ve index'leri 0,1,2... şeklinde ayarlar

    index      Maaş       Yaş  Çalışma Saati
0  Behçet -0.279271 -0.117491      -0.406650
1   Yavuz  1.325608 -0.187190       1.229221
2   Gizem  0.399037  0.743723       0.394010
3  Şevval -0.908296 -1.503358       0.261190

In [23]:
isimListesi = ["a","b","c","d"]
yeniDataFrame["Yeni Index"] = isimListesi

In [24]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati Yeni Index
Behçet -0.279271 -0.117491      -0.406650          a
Yavuz   1.325608 -0.187190       1.229221          b
Gizem   0.399037  0.743723       0.394010          c
Şevval -0.908296 -1.503358       0.261190          d

In [25]:
yeniDataFrame.set_index("Yeni Index") # kolonlarımızı row'ların index'i yapabiliriz. ama bu yapım dataFrame'i etkilemez

                Maaş       Yaş  Çalışma Saati
Yeni Index
a          -0.279271 -0.117491      -0.406650
b           1.325608 -0.187190       1.229221
c           0.399037  0.743723       0.394010
d          -0.908296 -1.503358       0.261190

In [26]:
yeniDataFrame.set_index("Yeni Index", inplace=True) #dataFrame'in üzerine işler

In [27]:
yeniDataFrame

                Maaş       Yaş  Çalışma Saati
Yeni Index
a          -0.279271 -0.117491      -0.406650
b           1.325608 -0.187190       1.229221
c           0.399037  0.743723       0.394010
d          -0.908296 -1.503358       0.261190

## Multi Index & Çoklu İndeks

In [28]:
disIndex = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]
icIndex = ["Homer","Bart","Marge","Cartman","Kyle","Kenny"]
birlesmisIndex = list(zip(disIndex,icIndex))

In [29]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kyle'),
 ('South Park', 'Kenny')]

In [30]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)

In [32]:
birlesmisIndex #multiIndex'imizi oluşturduk. birlesmisIndex tuple olduğu için from_tuples kullandık

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',    'Kyle'),
            ('South Park',   'Kenny')],
           )

In [34]:
cizgiFilmListem = [["A",40],["B",20],["C",45],["D",12],["E",24],["F",10]]
cizgiFilmNumpy = np.array(cizgiFilmListem)

In [35]:
cizgifilmDataFrame = pd.DataFrame(cizgiFilmNumpy,index=birlesmisIndex,columns=["Meslek", "Yaş"])

In [36]:
cizgifilmDataFrame #2 tane index'mizi bulunuyor.

                   Meslek Yaş
Simpson    Homer        A  40
           Bart         B  20
           Marge        C  45
South Park Cartman      D  12
           Kyle         E  24
           Kenny        F  10

In [41]:
cizgifilmDataFrame.loc["Simpson"]

      Meslek Yaş
Homer      A  40
Bart       B  20
Marge      C  45

In [43]:
cizgifilmDataFrame.loc["Simpson"].loc["Homer"]

Meslek     A
Yaş       40
Name: Homer, dtype: object

In [46]:
cizgifilmDataFrame.index.names = ("Aile Adı", "İsim") #index'lerimize de başlık verebiliriz

In [47]:
cizgifilmDataFrame

                   Meslek Yaş
Aile Adı   İsim
Simpson    Homer        A  40
           Bart         B  20
           Marge        C  45
South Park Cartman      D  12
           Kyle         E  24
           Kenny        F  10